code/security-ws/output/ws-securitypolicy/username-timestamp-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security
                xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp wsu:Id="TS-192bc0a0-12c4-4287-993e-2cf5898ddd73">
                <wsu:Created>2016-04-18T16:16:39.073Z</wsu:Created>
                <wsu:Expires>2016-04-18T16:21:39.073Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-258aed42-d7b4-41e7-b39a-23d4ab577bd4">
                <wsse:Username>cmoulliard</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    01m8/TPHQQiahfdkoykg2DaKmVs=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    cElhFTdZx+C/kBqiDxJwkQ==
                </wsse:Nonce>
                <wsu:Created>2016-04-18T16:16:39.095Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <greetMe xmlns="http://jboss.org/HelloWorld/types">
            <requestType>Charles</requestType>
        </greetMe>
    </soap:Body>
</soap:Envelope>
